Tekla.Structures.ModelInternal.BimModelDataProduct.CompatibilityStatus
Compatibility status between Tekla Structures and Bim Model data product.

Tekla.Structures.ModelInternal.BimModelDataProduct.CompatibilityStatus.Success
TS is compatible with the data product.

Tekla.Structures.ModelInternal.BimModelDataProduct.CompatibilityStatus.UpgradeRecommended
TS upgrade is recommended.
Client can still use the data product but some features may not be available or fully supported.

Tekla.Structures.ModelInternal.BimModelDataProduct.CompatibilityStatus.UpgradeRequired
TS upgrade is required.
API calls to data product will fail until TS is upgraded to a supported version.

Tekla.Structures.ModelInternal.BimModelDataProduct.CompatibilityStatus.Deprecated
The data product is deprecated. Integrations should be updated to use a different data product.
The data product has limited support and will not receive any new features or updates.

Tekla.Structures.ModelInternal.BimModelDataProduct.CompatibilityStatus.EndOfLife
The data product has reached its end of life and will be removed later.